<?php
// 以下をfor文を使用して表示してください。
// ヒント: forの中でforを３回使用

// ********1　
// *******121
// ******12321
// *****1234321
// ****123454321
// ***12345654321
// **1234567654321
// *123456787654321
// 12345678987654321

$rows = 9;

for ($i = 1; $i <= $rows; $i++) {
  $output = '';
  for ($j = 1; $j <= $rows - $i; $j++) {
    $output .= ' ';
  }
  for ($k = 1; $k <= $i; $k++) {
    $output .= $k;
  }
  for ($l = $i - 1; $l >= 1; $l--) {
    $output .= $l;
  }
  $output = str_replace(' ', '*', $output);
  echo $output . '<br>';
}

?>